namespace  template {
    /**
     * 在有些没有明确指出类型的地方，类型推论会帮助提供类型。
     */
    console.info("######################001");
    {
        //推断为数字类型
        let x = 3;
        console.info(x)
    }
    /**
     * 当需要从几个表达式中推断类型时候，会使用这些表达式的类型来推断出一个最合适的通用类型。
     */
    console.info("######################002");
    {
        //为了推断x的类型，我们必须考虑所有元素的类型。 这里有两种选择： number和null。
        let x = [0, 1, null];
        console.info(x)
        /**
         * 如果没有找到最佳通用类型的话，类型推论的结果是空对象类型，{}。
         * 因为这个类型没有任何成员，所以访问其成员的时候会报错。
         */
    }
}
